Week7/A_IcoFoam/channelFlowMyIcoFoamConvective/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    out
    {
        type            zeroGradient;
    }
    in
    {
        type            fixedValue;
	value		uniform (0.05 0 0);
    }
    walls
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }
}

// ************************************************************************* //
