Week7/A_IcoFoam/channelFlowMyIcoFoamConvective/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication blockMesh
#runApplication decomposePar -force
#runParallel $application 2
#runApplication reconstructPar
runApplication $application
